Este es un fichero complementario a la conferencia #8. 

El estudiante debe de buscar la definición de cada sintaxis en el manual oficial de SQL.

## Recordando ...

#### ¿Qué es un Sistema de Gestión de Bases de Datos?

Un sistema de gestión de bases de datos es un sistema computacional que proporciona funcionalidades, medios o servicios para manipular todos los accesos a una base de datos o una colección de bases de datos.

#### ¿Cómo se establece la comunicación con un SGBD?

1. Conocer la dirección donde se encuentra _hosteado_ el sistema gestor.
2. Utilizar un cliente para el envío de las peticiones y recibir la respuesta.
3. El mensaje está definido en un dialecto entendible por el sistema gestor.

In [1]:
# Inicializamos el cliente para conectarnos al gestor de bases de datos
# Esto permite usar expresiones SQL posteriormente y ver la respuesta de cada instrucción definida
%load_ext sql

Para establecer la conexión con el gestor se utiliza un *connection string* que generalmente contiene la siguiente información.

- Sistema gestor utilizado 
  - mysql
- Dirección del sistema gestor 
  - ip: localhost 
  - puerto: 3306
- Credenciales de seguridad 
  - usuario: root 
  - contraseña: 1q2w3e4r

In [2]:
# Establecemos una conexión con el sistema gestor con un connection string
%sql mysql://root:1q2w3e4r@localhost:3306

Una vez conectados podemos empezar a trabajar con SQL :), entonces...

## Data Definition Language (DDL)

### Lenguaje de definición de datos

Empecemos listando las bases de datos que controla nuestro sistema gestor

In [3]:
%sql show databases

 * mysql://root:***@localhost:3306
4 rows affected.

[('information_schema',), ('mysql',), ('performance_schema',), ('sys',)]

Las palabras reservadas en SQL pueden ser escritas en mayúscula o minúscula en su totalidad, puesto que son entendibles para el SGBD.

Verificar la salida de la instrucción:

```sql
SHOW DATABASES
```

Ahora vamos a crear nuestra primera base de datos :) con la sentencia

```sql
CREATE DATABASE [IF NOT EXISTS] <database_name>
```

El uso del cuantificador `IF NOT EXISTS` permite el control de un error en caso de que exista una base de datos con igual nombre.

In [4]:
%%sql 

create database if not exists example_database

-- Esta es la sintaxis para definir un comentario en SQL

/* 
Probando otra sintaxis para definir comentarios dentro de una instrucción
*/

 * mysql://root:***@localhost:3306
1 rows affected.

[]

Entonces eliminemos nuestra primera base de datos :( con la sentencia

```sql
DROP DATABASE [IF EXISTS] <database_name>
```

In [5]:
%sql drop database example_database

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Una vez que hayamos definido la base de datos, estamos listos para crear tablas y trabajar con los datos.

Para esto, hay que indicar la base de datos que se utilizará para nuestras operaciones, utilizando la sentencia

```sql
USE <database_name>
```

In [6]:
# crear la base de datos, puesto que se eliminó
%sql create database example_database

%sql use example_database

 * mysql://root:***@localhost:3306
1 rows affected.
 * mysql://root:***@localhost:3306
0 rows affected.

[]

### Definición y manipulación de tablas

La sintaxis para definir una tabla es:

```sql 
CREATE TABLE <table_name> (<ATTRIBUTES_DEFINITIONS>, <CONSTRAINTS_DEFINITIONS>)
```

Primero definimos los atributos de la tabla

-------

**Atributos**: 

```sql
<attribute_name> <data_type> [DEFAULT <value>] [NOT NULL]
```

Y luego definimos las restricciones de integridad (llave primaria, llaves foráneas, unicidad y chequeos)

--------

**Llave primaria**:

```sql
PRIMARY KEY <attribute_name>
```

-------

**Llave foránea**:

```sql
FOREIGN KEY <foreign_key_name> (<attributes_name>) REFERENCES <table_name>(<attributes_name>) <MODIFIERS>
```

Los modificadores de las llaves foráneas nos permiten definir el comportamiento de las mismas ante el cambio de los valores a los que referencian:

`ON DELETE`: `CASCADE`, `RESTRICT`, `SET NULL`, `SET DEFAULT`, `NO ACTION`

`ON UPDATE`: `CASCADE`, `RESTRICT`, `SET NULL`, `SET DEFAULT`, `NO ACTION`

---------

**Unicidad**:

```sql 
UNIQUE <attribute_name>
```

El modificador `UNIQUE` es el recurso que provee SQL para poder asegurar que se cumplen las restricciones impuestas por múltiples llaves candidatas dentro de una misma tabla

---------

**Chequeo**:

```sql
CHECK (<conditional_expression>)
```

In [7]:
%%sql

create table estudiante (
    id int not null auto_increment,
    nombre char(20) not null,
    grupo char(4) not null,
    provincia char(20) not null,
    email char(30) not null unique,
    sexo boolean,
    primary key (id)
)

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Para obtener información de la estructura de una tabla, se utiliza

```sql
DESCRIBE <table_name>
```

In [8]:
%sql describe estudiante

 * mysql://root:***@localhost:3306
6 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nombre', 'char(20)', 'NO', '', None, ''),
 ('grupo', 'char(4)', 'NO', '', None, ''),
 ('provincia', 'char(20)', 'NO', '', None, ''),
 ('email', 'char(30)', 'NO', 'UNI', None, ''),
 ('sexo', 'tinyint(1)', 'YES', '', None, '')]

In [9]:
%%sql
create table asignatura (
    id int not null auto_increment,
    nombre char(20) not null,
    horas smallint default 64,
    primary key (id)
)

 * mysql://root:***@localhost:3306
0 rows affected.

[]

In [10]:
%%sql
create table calificacion (
    estudianteid int not null,
    asignaturaid int not null,
    nota smallint not null,
    primary key (estudianteid, asignaturaid),
    foreign key cal_est(estudianteid) references estudiante(id) on delete restrict on update cascade,
    foreign key cal_asg(asignaturaid) references asignatura(id) on delete restrict on update cascade,
    check(nota >=2 and nota <=5)
)

 * mysql://root:***@localhost:3306
0 rows affected.

[]

Si se consulta la estructura de la tabla `calificacion`, ¿por qué no se muestran todas las restricciones?

In [11]:
%sql describe calificacion

 * mysql://root:***@localhost:3306
3 rows affected.

[('estudianteid', 'int', 'NO', 'PRI', None, ''),
 ('asignaturaid', 'int', 'NO', 'PRI', None, ''),
 ('nota', 'smallint', 'NO', '', None, '')]

Una vez que se define una tabla puede ser modificada utilizando la cláusula `ALTER` 

```sql 
ALTER TABLE <table_name> 
    [ADD <attribute_def>]
    [ALTER <attribute_name> [SET DEFAULT, DROP DEFAULT]] 
    [DROP <attribute_name> [CASCADE, RESTRICT]] 
    [ADD, DROP <constraint_name>]
```

O eliminada utilizando `DROP`
```sql
DROP TABLE <table_name>
```

En ocasiones, para ciertos SGDB difiere la sintaxis que hereda del SQL estándar. Por ejemplo, en MySQL la sintaxis `ALTER <attribute_name>` se sustituye por `MODIFY COLUMN <attribute_name>`.

In [13]:
# %sql alter table estudiante add no_cuenta int not null
%sql alter table estudiante modify column no_cuenta char(16) default '000000000000000'
# %sql alter table estudiante drop no_cuenta

%sql describe estudiante

 * mysql://root:***@localhost:3306
0 rows affected.
 * mysql://root:***@localhost:3306
7 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('nombre', 'char(20)', 'NO', '', None, ''),
 ('grupo', 'char(4)', 'NO', '', None, ''),
 ('provincia', 'char(20)', 'NO', '', None, ''),
 ('email', 'char(30)', 'NO', 'UNI', None, ''),
 ('sexo', 'tinyint(1)', 'YES', '', None, ''),
 ('no_cuenta', 'char(16)', 'YES', '', '000000000000000', '')]

Un **índice** es una estructura de almacenamiento físico que permite conservar determinados valores de una o más columnas, para agilizar el trabajo de la manipulación de grandes conjuntos de datos.

El uso de un índice mejora el rendimiento de las consultas que utilizan dichas columnas como filtros y permite garantizar la unicidad en llaves alternativas. Sin embargo, consume espacio adicional y es necesario actualizarlo por cada operación de manipulación.

```sql
CREATE [UNIQUE] INDEX <index_name> ON <table_name> (<column_name> [ASC, DESC],...)

DROP INDEX <index_name> ON <table_name>
```

In [14]:
%sql create index index_email on estudiante (email)
# %sql drop index index_email on estudiante

 * mysql://root:***@localhost:3306
0 rows affected.

[]

La instrucción 

```sql
SHOW INDEX <index_name> ON <table_name>
```

muestra los índices asociados a una tabla. Por defecto, la llave primaria de la tabla es el índice que primero se asegura por el gestor de la base de datos.

In [15]:
%sql show index from estudiante

 * mysql://root:***@localhost:3306
3 rows affected.

[('estudiante', 0, 'PRIMARY', 1, 'id', 'A', 0, None, None, '', 'BTREE', '', '', 'YES', None),
 ('estudiante', 0, 'email', 1, 'email', 'A', 0, None, None, '', 'BTREE', '', '', 'YES', None),
 ('estudiante', 1, 'index_email', 1, 'email', 'A', 0, None, None, '', 'BTREE', '', '', 'YES', None)]

### Particionamiento

El particionamiento de una tabla permite dividir una tabla en varias tablas físicas mientras que lógicamente funcionan como una sola tabla. Esto permite mejorar el rendimiento de las operaciones ya que las operaciones se realizan sobre tablas físicas de menor tamaño. Sin embargo, las consultas que requieren reconstruir la tabla completa son más lentas.

```sql
CREATE TABLE <table_name> (<table_definition>)
    PARTITIONED BY [RANGE, LIST, HASH, KEY]
````

### Vistas

Una vista `VIEW` es una tabla virtual (lógica), cuya definición se almacena
en el catálogo o diccionario de la base de datos y se ejecuta cada vez
que se hace referencia a ella en alguna instrucción de la consulta SQL 

```sql
CREATE VIEW <view_name> (<attribute_names>) AS <select_statement>

DROP VIEW <view_name>
```

## Data Manipulation Language (DML)

### Lenguaje de Manipulación de Datos

La sintaxis para insertar una tupla es 

```sql
INSERT INTO <table_name> (<attributes_name>) VALUES [(<constant_values>), <select_statement>]
```

La sintaxis para eliminar una o varias tuplas es

```sql
DELETE FROM <table_name> WHERE <conditional_expression>
```

Donde todas las tuplas que cumplan la condición `<conditional_expression>` serán las eliminadas.

La sintaxis para actualizar una o más tuplas es

```sql
UPDATE <table_name> SET [<attribute_name> = <expression>] WHERE <conditional_expression>
```

Al igual que en la cláusula anterior, las tuplas modificadas son todas aquellas donde se evalue la expresión `<conditional_expression>` como verdadera.

In [16]:
%%sql
insert into estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) 
VALUES ('Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', '1234', 1);

insert into estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) 
VALUES ('Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', '5678', 1);

select * from estudiante

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.
2 rows affected.

[(1, 'Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', 1, '5678')]

In [17]:
%%sql
insert into estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) VALUES ('Gabriela', 'C311', 'La Habana', 'gabriela@matcom.uh.cu', '9087', 0);
insert into estudiante (nombre, grupo, provincia, email, no_cuenta, sexo) VALUES ('Lucina', 'C312', 'La Habana', 'lucina@matcom.uh.cu', '4327', 0);

select * from estudiante

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.
4 rows affected.

[(1, 'Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', 1, '5678'),
 (3, 'Gabriela', 'C311', 'La Habana', 'gabriela@matcom.uh.cu', 0, '9087'),
 (4, 'Lucina', 'C312', 'La Habana', 'lucina@matcom.uh.cu', 0, '4327')]

In [18]:
%%sql
insert into estudiante (nombre, grupo, provincia, email, no_cuenta) VALUES ('Carlos', 'C311', 'La Habana', 'carlos@matcom.uh.cu', '3579');

select * from estudiante;

 * mysql://root:***@localhost:3306
1 rows affected.
5 rows affected.

[(1, 'Victor', 'C311', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C312', 'La Habana', 'andy@matcom.uh.cu', 1, '5678'),
 (3, 'Gabriela', 'C311', 'La Habana', 'gabriela@matcom.uh.cu', 0, '9087'),
 (4, 'Lucina', 'C312', 'La Habana', 'lucina@matcom.uh.cu', 0, '4327'),
 (5, 'Carlos', 'C311', 'La Habana', 'carlos@matcom.uh.cu', None, '3579')]

¿Qué está mal en los datos? ¿Cómo se arregla?

In [19]:
%%sql
insert into asignatura (nombre) values ('Lógica');
insert into asignatura (nombre) values ('Álgebra');
insert into asignatura (nombre) values ('Análisis');
insert into asignatura (nombre) values ('Análisis');
insert into asignatura (nombre) values ('Análisis');

select * from asignatura

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
5 rows affected.

[(1, 'Lógica', 64),
 (2, 'Álgebra', 64),
 (3, 'Análisis', 64),
 (4, 'Análisis', 64),
 (5, 'Análisis', 64)]

¿Qué está mal en los datos? Cómo sse arregla?

In [20]:
%%sql 

insert into calificacion (estudianteid, asignaturaid, nota) values (1, 3, 5);

select * from calificacion;

 * mysql://root:***@localhost:3306
1 rows affected.
1 rows affected.

[(1, 3, 5)]

In [ ]:
%sql delete from estudiante where true

In [21]:
%%sql 

update estudiante set grupo = 'C211' where provincia = 'La Habana';
select * from estudiante;

 * mysql://root:***@localhost:3306
5 rows affected.
5 rows affected.

[(1, 'Victor', 'C211', 'La Habana', 'victor@matcom.uh.cu', 1, '1234'),
 (2, 'Andy', 'C211', 'La Habana', 'andy@matcom.uh.cu', 1, '5678'),
 (3, 'Gabriela', 'C211', 'La Habana', 'gabriela@matcom.uh.cu', 0, '9087'),
 (4, 'Lucina', 'C211', 'La Habana', 'lucina@matcom.uh.cu', 0, '4327'),
 (5, 'Carlos', 'C211', 'La Habana', 'carlos@matcom.uh.cu', None, '3579')]

Hemos definido llaves llaves foráneas pero no hemos comprabado su existencia. La siguiente instrucción las muestra.

In [22]:
%sql SELECT * FROM information_schema.KEY_COLUMN_USAGE WHERE TABLE_SCHEMA = 'example_database' AND TABLE_NAME in ('estudiante', 'calificacion')

 * mysql://root:***@localhost:3306
6 rows affected.

[('def', 'example_database', 'PRIMARY', 'def', 'example_database', 'calificacion', 'estudianteid', 1, None, None, None, None),
 ('def', 'example_database', 'PRIMARY', 'def', 'example_database', 'calificacion', 'asignaturaid', 2, None, None, None, None),
 ('def', 'example_database', 'calificacion_ibfk_1', 'def', 'example_database', 'calificacion', 'estudianteid', 1, 1, 'example_database', 'estudiante', 'id'),
 ('def', 'example_database', 'calificacion_ibfk_2', 'def', 'example_database', 'calificacion', 'asignaturaid', 1, 1, 'example_database', 'asignatura', 'id'),
 ('def', 'example_database', 'email', 'def', 'example_database', 'estudiante', 'email', 1, None, None, None, None),
 ('def', 'example_database', 'PRIMARY', 'def', 'example_database', 'estudiante', 'id', 1, None, None, None, None)]